package types

import (
	"regexp"

	"github.com/bwmarrin/discordgo"
	"github.com/dlclark/regexp2"
	"gorm.io/gorm"
)

type GlobalBan struct {
	Code    int64  `json:"code"`
	Status  string `json:"status"`
	Content []Ban  `json:"content"`
}

type Ban struct {
	ID        int64       `json:"ID"`
	CreatedAt string      `json:"CreatedAt"`
	UpdatedAt string      `json:"UpdatedAt"`
	DeletedAt interface{} `json:"DeletedAt"`
	Reason    string      `json:"Reason"`
}

type TransMCServer struct {
	FeedMCServer
	Address string
	Port    uint16
}

type FeedMCServer struct {
	gorm.Model
	Hash      string `gorm:"uniqueIndex"`
	GuildID   string
	ChannelID string
	RoleID    string
	Name      string
	Locale    discordgo.Locale
}

type FeedMCServers []FeedMCServer

type ImagePngHash struct {
	gorm.Model
	Hash string `gorm:"primarykey"`
	Data string `gorm:"primarykey"`
}

type Res struct {
	Code    int64       `json:"code"`
	Status  string      `json:"status"`
	Content interface{} `json:"content"`
}

type MCServer struct {
	gorm.Model
	Hash    string `gorm:"uniqueIndex"`
	Address string
	Port    uint16
	Online  bool
}

type MCServers []MCServer

type PanelEmojiConfig struct {
	Message     string
	Emojis      []*discordgo.ComponentEmoji
	MessageData *discordgo.Message
	SelectMenu  discordgo.SelectMenu
}

type MessageSelect struct {
	MemberID string
	GuildID  string
}

var StL = map[string]discordgo.Locale{
	"English (Great Britain)": discordgo.EnglishGB,
	"Bulgarian":               discordgo.Bulgarian,
	"Chinese (China)":         discordgo.ChineseCN,
	"Chinese (Taiwan)":        discordgo.ChineseTW,
	"Croatian":                discordgo.Croatian,
	"Czech":                   discordgo.Czech,
	"Danish":                  discordgo.Danish,
	"Dutch":                   discordgo.Dutch,
	"Finnish":                 discordgo.Finnish,
	"French":                  discordgo.French,
	"German":                  discordgo.German,
	"Greek":                   discordgo.Greek,
	"Hindi":                   discordgo.Hindi,
	"Hungarian":               discordgo.Hungarian,
	"Italian":                 discordgo.Italian,
	"Japanese":                discordgo.Japanese,
	"Korean":                  discordgo.Korean,
	"Lithuanian":              discordgo.Lithuanian,
	"Norwegian":               discordgo.Norwegian,
	"Polish":                  discordgo.Polish,
	"Portuguese (Brazil)":     discordgo.PortugueseBR,
	"Romanian":                discordgo.Romanian,
	"Russian":                 discordgo.Russian,
	"Spanish (Spain)":         discordgo.SpanishES,
	"Swedish":                 discordgo.Swedish,
	"Thai":                    discordgo.Thai,
	"Turkish":                 discordgo.Turkish,
	"Ukrainian":               discordgo.Ukrainian,
	"Vietnamese":              discordgo.Vietnamese,
	"unknown":                 discordgo.Unknown,
}

var Twemoji = regexp2.MustCompile("(😀|😃|😄|😁|😆|😅|🤣|😂|🙂|🙃|🫠|😉|😊|😇|🥰|😍|🤩|😘|😗|☺️|😚|😙|🥲|😋|😛|😜|🤪|😝|🤑|🤗|🤭|🫢|🫣|�|🤔|🫡|🤐|🤨|😐|😑|😶|🫥|😶‍🌫️|😏|😒|🙄|😬|😮‍💨|🤥|😌|😔|😪|🤤|😴|😷|🤒|🤕|🤢|🤮|🤧|🥵|🥶|🥴|😵|😵‍💫|🤯|🤠|🥳|🥸|😎|🤓|🧐|😕|🫤|😟|🙁|☹️|😮|😯|😲|😳|🥺|🥹|😦|😧|😨|😰|😥|😢|😭|�|😖|😣|😞|😓|😩|😫|🥱|😤|😡|😠|🤬|😈|👿|💀|☠️|💩|🤡|👹|👺|👻|👽|👾|🤖|😺|😸|😹|�|😼|😽|🙀|😿|😾|🙈|🙉|🙊|💋|💌|💘|💝|💖|💗|💓|💞|💕|💟|❣️|💔|❤️‍🔥|❤️‍🩹|❤️|🧡|💛|💚|💙|💜|🤎|🖤|🤍|💯|💢|💥|💫|💦|💨|🕳️|💣|💬|👁️‍🗨️|🗨️|🗯️|💭|💤|👋|🤚|🖐️|✋|🖖|🫱|🫲|🫳|🫴|👌|🤌|🤏|✌️|🤞|🫰|🤟|🤘|🤙|👈|👉|👆|🖕|👇|☝️|🫵|👍|👎|✊|👊|🤛|🤜|👏|🙌|🫶|👐|🤲|🤝|🙏|✍️|💅|🤳|💪|🦾|🦿|🦵|🦶|👂|🦻|👃|🧠|🫀|🫁|🦷|🦴|👀|👁️|👅|👄|🫦|👶|🧒|👦|👧|🧑|👱|👨|🧔|🧔‍♂️|🧔‍♀️|👨‍🦰|👨‍🦱|👨‍🦳|👨‍🦲|👩|👩‍🦰|🧑‍🦰|👩‍🦱|🧑‍🦱|👩‍🦳|🧑‍🦳|👩‍🦲|🧑‍🦲|👱‍♀️|👱‍♂️|🧓|👴|👵|🙍|🙍‍♂️|🙍‍♀️|🙎|🙎‍♂️|🙎‍♀️|🙅|🙅‍♂️|🙅‍♀️|🙆|🙆‍♂️|🙆‍♀️|💁|💁‍♂️|💁‍♀️|🙋|🙋‍♂️|🙋‍♀️|🧏|🧏‍♂️|🧏‍♀️|🙇|🙇‍♂️|🙇‍♀️|🤦|🤦‍♂️|🤦‍♀️|🤷|🤷‍♂️|🤷‍♀️|🧑‍⚕️|👨‍⚕️|👩‍⚕️|🧑‍🎓|👨‍🎓|👩‍🎓|🧑‍🏫|👨‍🏫|👩‍🏫|🧑‍⚖️|👨‍⚖️|👩‍⚖️|🧑‍🌾|👨‍🌾|👩‍🌾|🧑‍🍳|👨‍🍳|👩‍🍳|🧑‍🔧|👨‍🔧|👩‍🔧|🧑‍🏭|👨‍🏭|👩‍🏭|🧑‍💼|👨‍💼|👩‍💼|🧑‍🔬|👨‍🔬|👩‍🔬|🧑‍💻|👨‍💻|👩‍💻|🧑‍🎤|👨‍🎤|👩‍�|🧑‍🎨|👨‍🎨|👩‍🎨|🧑‍✈️|👨‍✈️|👩‍✈️|🧑‍🚀|👨‍🚀|👩‍🚀|🧑‍🚒|👨‍🚒|👩‍🚒|👮|👮‍♂️|👮‍♀️|🕵️|🕵️‍♂️|🕵️‍♀️|💂|💂‍♂️|💂‍♀️|🥷|👷|👷‍♂️|👷‍♀️|🫅|🤴|👸|👳|👳‍♂️|👳‍♀️|👲|🧕|🤵|🤵‍♂️|🤵‍♀️|👰|👰‍♂️|👰‍♀️|🤰|🫃|🫄|🤱|👩‍🍼|👨‍🍼|🧑‍🍼|👼|🎅|🤶|🧑‍🎄|🦸|🦸‍♂️|🦸‍♀️|🦹|🦹‍♂️|🦹‍♀️|🧙|🧙‍♂️|🧙‍♀️|🧚|🧚‍♂️|🧚‍♀️|🧛|🧛‍♂️|🧛‍♀️|🧜|🧜‍♂️|🧜‍♀️|🧝|🧝‍♂️|🧝‍♀️|🧞|🧞‍♂️|🧞‍♀️|🧟|🧟‍♂️|🧟‍♀️|🧌|💆|💆‍♂️|💆‍♀️|💇|💇‍♂️|💇‍♀️|🚶|🚶‍♂️|🚶‍♀️|🧍|🧍‍♂️|🧍‍♀️|🧎|🧎‍♂️|🧎‍♀️|🧑‍🦯|👨‍🦯|👩‍🦯|🧑‍🦼|👨‍🦼|👩‍🦼|🧑‍🦽|👨‍🦽|👩‍🦽|🏃|🏃‍♂️|🏃‍♀️|💃|🕺|🕴️|👯|👯‍♂️|👯‍♀️|🧖|🧖‍♂️|🧖‍♀️|🧗|🧗‍♂️|🧗‍♀️|🤺|🏇|⛷️|🏂|🏌️|🏌️‍♂️|🏌️‍♀️|🏄|🏄‍♂️|🏄‍♀️|🚣|🚣‍♂️|🚣‍♀️|🏊|🏊‍♂️|🏊‍♀️|⛹️|⛹️‍♂️|⛹️‍♀️|🏋️|🏋️‍♂️|🏋️‍♀️|🚴|🚴‍♂️|🚴‍♀️|🚵|🚵‍♂️|🚵‍♀️|🤸|�‍‍♂️|🤸‍♀️|🤼|🤼‍♂️|🤼‍♀️|🤽|🤽‍♂️|🤽‍♀️|🤾|🤾‍♂️|🤾‍♀️|🤹|🤹‍♂️|🤹‍♀️|🧘|🧘‍♂️|�‍♀️|🛀|🛌|🧑‍🤝‍🧑|👭|👫|👬|💏|👩‍❤️‍💋‍👨|👨‍❤️‍💋‍👨|👩‍❤️‍💋‍👩|💑|👩‍❤️‍👨|👨‍❤️‍👨|👩‍❤️‍👩|👪|👨‍👩‍👦|👨‍👩‍👧|👨‍👩‍👧‍👦|👨‍👩‍👦‍👦|👨‍👩‍👧‍👧|👨‍👨‍👦|👨‍👨‍👧|👨‍👨‍👧‍👦|👨‍👨‍👦‍👦|👨‍👨‍👧‍👧|👩‍👩‍👦|👩‍👩‍👧|👩‍👩‍👧‍👦|👩‍👩‍👦‍👦|👩‍👩‍👧‍👧|👨‍👦|👨‍👦‍👦|👨‍👧|👨‍👧‍👦|👨‍👧‍👧|👩‍👦|👩‍👦‍👦|👩‍👧|👩‍👧‍👦|👩‍👧‍👧|🗣️|👤|👥|🫂|👣|🐵|🐒|🦍|🦧|🐶|🐕|🦮|🐕‍🦺|🐩|🐺|🦊|🦝|🐱|🐈|🐈‍⬛|🦁|🐯|🐅|🐆|🐴|🐎|🦄|🦓|🦌|🦬|🐮|🐂|🐃|🐄|🐷|🐖|🐗|🐽|�|🐑|🐐|🐪|🐫|🦙|🦒|🐘|🦣|🦏|🦛|🐭|🐁|🐀|🐹|🐰|🐇|🐿️|🦫|🦔|🦇|🐻|🐻‍❄️|🐨|🐼|🦥|🦦|🦨|🦘|🦡|🐾|🦃|🐔|🐓|🐣|🐤|🐥|🐦|🐧|🕊️|🦅|🦆|🦢|🦉|🦤|🪶|🦩|🦚|🦜|🐸|🐊|🐢|🦎|🐍|🐲|🐉|🦕|🦖|🐳|🐋|🐬|🦭|🐟|🐠|🐡|🦈|🐙|🐚|🪸|🐌|🦋|🐛|🐜|🐝|🪲|🐞|🦗|🪳|🕷️|🕸️|🦂|🦟|🪰|🪱|🦠|�|🌸|💮|🪷|🏵️|🌹|🥀|🌺|🌻|🌼|🌷|🌱|🪴|🌲|🌳|🌴|🌵|🌾|🌿|☘️|🍀|🍁|🍂|🍃|🪹|🪺|🍇|🍈|🍉|🍊|🍋|🍌|🍍|�|🍎|🍏|🍐|🍑|🍒|🍓|🫐|🥝|🍅|🫒|🥥|🥑|🍆|🥔|🥕|🌽|🌶️|🫑|🥒|🥬|🥦|🧄|🧅|🍄|🥜|🫘|🌰|🍞|🥐|🥖|🫓|🥨|🥯|🥞|🧇|🧀|🍖|🍗|🥩|🥓|🍔|🍟|🍕|🌭|🥪|🌮|🌯|🫔|🥙|🧆|🥚|🍳|🥘|🍲|🫕|🥣|🥗|🍿|🧈|�|🥫|🍱|🍘|🍙|🍚|🍛|🍜|🍝|🍠|🍢|🍣|🍤|🍥|🥮|🍡|🥟|🥠|🥡|🦀|🦞|🦐|🦑|🦪|🍦|🍧|🍨|�|🍪|🎂|🍰|🧁|🥧|🍫|🍬|🍭|🍮|🍯|🍼|🥛|☕|🫖|🍵|🍶|🍾|🍷|🍸|🍹|🍺|🍻|🥂|🥃|🫗|🥤|🧋|🧃|🧉|🧊|🥢|🍽️|🍴|🥄|🔪|🫙|🏺|🌍|🌎|🌏|🌐|🗺️|🗾|🧭|🏔️|⛰️|🌋|🗻|🏕️|🏖️|🏜️|🏝️|🏞️|🏟️|🏛️|🏗️|�|🪨|🪵|🛖|🏘️|🏚️|🏠|🏡|🏢|🏣|🏤|🏥|🏦|🏨|🏩|🏪|🏫|🏬|🏭|🏯|🏰|💒|🗼|🗽|⛪|🕌|🛕|🕍|⛩️|🕋|⛲|⛺|🌁|🌃|🏙️|🌄|🌅|🌆|🌇|🌉|♨️|🎠|🛝|🎡|🎢|💈|🎪|🚂|🚃|🚄|🚅|🚆|🚇|🚈|🚉|🚊|🚝|🚞|🚋|🚌|🚍|🚎|🚐|🚑|🚒|🚓|🚔|🚕|🚖|🚗|🚘|🚙|🛻|🚚|🚛|🚜|🏎️|🏍️|🛵|🦽|🦼|🛺|🚲|🛴|🛹|🛼|🚏|🛣️|🛤️|🛢️|⛽|🛞|🚨|🚥|🚦|🛑|🚧|⚓|🛟|⛵|🛶|🚤|🛳️|⛴️|🛥️|🚢|✈️|🛩️|🛫|🛬|🪂|💺|🚁|🚟|🚠|🚡|🛰️|🚀|🛸|🛎️|🧳|⌛|⏳|⌚|⏰|⏱️|⏲️|🕰️|🕛|🕧|🕐|🕜|🕑|🕝|🕒|🕞|🕓|🕟|🕔|🕠|🕕|🕡|🕖|🕢|🕗|🕣|🕘|🕤|🕙|🕥|🕚|🕦|🌑|🌒|🌓|🌔|🌕|🌖|🌗|🌘|🌙|🌚|🌛|🌜|🌡️|☀️|🌝|🌞|🪐|⭐|🌟|🌠|🌌|☁️|⛅|⛈️|🌤️|🌥️|🌦️|�️|🌨️|🌩️|🌪️|🌫️|🌬️|🌀|🌈|🌂|☂️|☔|⛱️|⚡|❄️|☃️|⛄|☄️|🔥|💧|🌊|🎃|🎄|🎆|🎇|🧨|✨|🎈|🎉|🎊|🎋|🎍|🎎|🎏|🎐|🎑|🧧|🎀|🎁|🎗️|🎟️|🎫|🎖️|🏆|🏅|🥇|🥈|🥉|⚽|⚾|🥎|🏀|🏐|🏈|🏉|🎾|🥏|🎳|🏏|🏑|🏒|🥍|🏓|🏸|🥊|🥋|🥅|⛳|⛸️|🎣|🤿|🎽|🎿|🛷|🥌|🎯|🪀|🪁|🎱|🔮|🪄|🧿|🪬|🎮|🕹️|🎰|🎲|🧩|🧸|🪅|🪩|🪆|♠️|♥️|♦️|♣️|♟️|🃏|🀄|🎴|🎭|🖼️|🎨|🧵|🪡|🧶|🪢|👓|🕶️|🥽|🥼|🦺|👔|👕|👖|🧣|🧤|🧥|🧦|👗|�|🥻|🩱|🩲|🩳|👙|👚|👛|👜|👝|🛍️|🎒|🩴|👞|👟|🥾|🥿|👠|👡|🩰|👢|👑|👒|🎩|🎓|🧢|🪖|⛑️|📿|💄|💍|💎|🔇|�|🔉|🔊|📢|📣|📯|🔔|🔕|🎼|🎵|🎶|🎙️|🎚️|🎛️|🎤|🎧|📻|🎷|🪗|🎸|🎹|🎺|🎻|🪕|🥁|🪘|�|📲|☎️|📞|📟|📠|🔋|🪫|🔌|💻|🖥️|🖨️|⌨️|🖱️|🖲️|💽|💾|💿|📀|🧮|🎥|🎞️|📽️|🎬|📺|📷|📸|📹|📼|🔍|🔎|🕯️|💡|🔦|🏮|🪔|📔|📕|📖|📗|📘|📙|📚|📓|📒|📃|📜|📄|📰|🗞️|📑|🔖|🏷️|💰|🪙|💴|💵|💶|💷|💸|💳|🧾|💹|✉️|📧|📨|📩|📤|📥|📦|📫|📪|📬|📭|📮|🗳️|✏️|✒️|🖋️|🖊️|🖌️|🖍️|📝|💼|📁|📂|🗂️|📅|📆|🗒️|🗓️|📇|📈|📉|📊|📋|📌|📍|📎|🖇️|📏|📐|✂️|🗃️|🗄️|🗑️|🔒|🔓|🔏|🔐|🔑|🗝️|🔨|🪓|⛏️|⚒️|🛠️|🗡️|⚔️|🔫|🪃|🏹|🛡️|🪚|🔧|🪛|🔩|⚙️|🗜️|⚖️|🦯|🔗|⛓️|🪝|🧰|🧲|🪜|⚗️|🧪|🧫|🧬|🔬|🔭|📡|💉|🩸|💊|🩹|🩼|🩺|🩻|🚪|🛗|🪞|🪟|🛏️|🛋️|🪑|🚽|🪠|🚿|🛁|🪤|🪒|🧴|🧷|🧹|🧺|🧻|🪣|🧼|🫧|🪥|🧽|🧯|🛒|🚬|⚰️|🪦|⚱️|🗿|🪧|🪪|🏧|🚮|🚰|♿|🚹|🚺|🚻|🚼|🚾|🛂|🛃|🛄|🛅|⚠️|🚸|⛔|🚫|🚳|🚭|🚯|🚱|🚷|📵|🔞|☢️|☣️|⬆️|↗️|➡️|↘️|⬇️|↙️|⬅️|↖️|↕️|↔️|↩️|↪️|⤴️|⤵️|🔃|🔄|🔙|🔚|🔛|🔜|🔝|🛐|⚛️|🕉️|✡️|☸️|☯️|✝️|☦️|☪️|☮️|🕎|🔯|♈|♉|♊|♋|♌|♍|♎|♏|♐|♑|♒|♓|⛎|🔀|🔁|🔂|▶️|⏩|⏭️|⏯️|◀️|⏪|⏮️|🔼|⏫|🔽|⏬|⏸️|⏹️|⏺️|⏏️|🎦|🔅|🔆|📶|📳|📴|♀️|♂️|⚧️|✖️|➕|➖|➗|🟰|♾️|‼️|⁉️|❓|❔|❕|❗|〰️|💱|💲|⚕️|♻️|⚜️|🔱|📛|🔰|⭕|✅|☑️|✔️|❌|❎|➰|➿|〽️|✳️|✴️|❇️|©️|®️|™️|#️⃣|️⃣|0️⃣|1️⃣|2️⃣|3️⃣|4️⃣|5️⃣|6️⃣|7️⃣|8️⃣|9️⃣|🔟|🔠|🔡|🔢|🔣|🔤|🅰️|🆎|🅱️|🆑|🆒|🆓|ℹ️|🆔|Ⓜ️|🆕|🆖|🅾️|🆗|🅿️|🆘|🆙|🆚|🈁|🈂️|🈷️|🈶|🈯|🉐|🈹|🈚|🈲|🉑|🈸|🈴|🈳|㊗️|㊙️|🈺|🈵|🔴|🟠|🟡|🟢|🔵|🟣|🟤|⚫|⚪|🟥|🟧|🟨|🟩|🟦|🟪|🟫|⬛|⬜|◼️|◻️|◾|◽|▪️|▫️|🔶|🔷|🔸|🔹|🔺|🔻|💠|🔘|🔳|🔲|🏁|🚩|🎌|🏴|🏳️|🏳️‍🌈|🏳️‍⚧️|🏴‍☠️|🇦🇨|🇦🇩|🇦🇪|🇦🇫|🇦🇬|🇦🇮|🇦🇱|🇦🇲|🇦🇴|🇦🇶|🇦🇷|🇦🇸|🇦🇹|🇦🇺|🇦🇼|🇦🇽|🇦🇿|🇧🇦|🇧🇧|🇧🇩|🇧🇪|🇧🇫|🇧🇬|🇧🇭|🇧🇮|🇧🇯|🇧🇱|🇧🇲|🇧🇳|🇧🇴|🇧🇶|🇧🇷|🇧🇸|🇧🇹|🇧🇻|🇧🇼|🇧🇾|🇧�|🇨🇦|🇨🇨|🇨🇩|🇨🇫|🇨🇬|🇨🇭|🇨🇮|🇨🇰|🇨🇱|🇨🇲|🇨🇳|🇨🇴|🇨🇵|🇨🇷|🇨🇺|🇨🇻|🇨🇼|🇨🇽|🇨🇾|🇨�|🇩🇪|🇩🇬|🇩🇯|🇩🇰|🇩🇲|🇩🇴|🇩🇿|🇪🇦|🇪🇨|🇪🇪|🇪🇬|🇪🇭|🇪🇷|🇪🇸|🇪🇹|🇪🇺|🇫🇮|🇫🇯|🇫🇰|🇫🇲|🇫🇴|🇫🇷|🇬🇦|🇬🇧|🇬🇩|🇬🇪|🇬🇫|🇬🇬|🇬🇭|🇬🇮|🇬🇱|🇬🇲|🇬🇳|🇬🇵|🇬🇶|🇬🇷|🇬🇸|🇬🇹|🇬🇺|🇬🇼|🇬🇾|🇭🇰|🇭🇲|🇭🇳|🇭🇷|🇭🇹|🇭🇺|🇮🇨|🇮🇩|🇮🇪|🇮🇱|🇮🇲|🇮🇳|🇮🇴|🇮🇶|🇮🇷|🇮🇸|🇮🇹|🇯🇪|🇯🇲|🇯🇴|🇯🇵|🇰🇪|🇰🇬|🇰🇭|🇰🇮|🇰🇲|🇰🇳|🇰🇵|🇰🇷|🇰🇼|🇰🇾|🇰🇿|🇱🇦|🇱🇧|🇱🇨|🇱🇮|🇱🇰|🇱🇷|🇱🇸|🇱🇹|🇱🇺|🇱🇻|🇱🇾|🇲🇦|🇲🇨|🇲🇩|🇲🇪|�🇫|🇲🇬|🇲🇭|🇲🇰|🇲🇱|🇲🇲|🇲🇳|🇲🇴|🇲🇵|🇲🇶|🇲🇷|🇲🇸|🇲🇹|🇲🇺|🇲🇻|🇲🇼|🇲🇽|🇲🇾|🇲🇿|🇳🇦|�🇨|🇳🇪|🇳🇫|🇳🇬|🇳🇮|🇳🇱|🇳🇴|🇳🇵|🇳🇷|🇳🇺|🇳🇿|🇴🇲|🇵🇦|🇵🇪|🇵🇫|🇵🇬|🇵🇭|🇵🇰|🇵🇱|🇵🇲|🇵🇳|🇵🇷|🇵🇸|🇵🇹|🇵🇼|🇵🇾|🇶🇦|🇷🇪|🇷🇴|🇷🇸|🇷🇺|🇷🇼|🇸🇦|🇸🇧|🇸🇨|🇸🇩|🇸🇪|🇸🇬|🇸🇭|🇸🇮|🇸🇯|🇸🇰|🇸🇱|🇸🇲|🇸🇳|🇸🇴|🇸🇷|🇸🇸|🇸🇹|🇸🇻|🇸🇽|🇸🇾|🇸�|🇹🇦|🇹🇨|🇹🇩|🇹🇫|🇹🇬|🇹🇭|🇹🇯|🇹🇰|🇹🇱|🇹🇲|🇹🇳|🇹🇴|🇹🇷|🇹🇹|🇹🇻|🇹🇼|🇹🇿|🇺🇦|🇺🇬|🇺�|🇺🇳|🇺🇸|🇺🇾|🇺🇿|🇻🇦|🇻🇨|🇻🇪|🇻🇬|🇻🇮|🇻🇳|🇻🇺|🇼🇫|🇼🇸|🇽🇰|🇾🇪|🇾🇹|🇿🇦|🇿🇲|🇿🇼|🏴󠁧󠁢󠁥󠁮󠁧󠁿|🏴󠁧󠁢󠁳󠁣󠁴󠁿|🏴󠁧󠁢󠁷󠁬󠁳󠁿|<(a|):[A-z0-9_~]+:[0-9]{18,20}>)", regexp2.None)
var CustomEmojiRegex = regexp.MustCompile(`<(a|):[A-z0-9_~]+:[0-9]{18,20}>`)
